rails_app/app/controllers/albums_controller.rb

  def index
    @albums=Album.order(:created_at => 'desc').limit(6)
---
SELECT "albums".* FROM "albums" ORDER BY "albums"."created_at" DESC LIMIT ?  [["LIMIT", 6]]

  def edit
    @upalbum=Album.find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def update
    @upalbum=Album.find(params[:id])
    if @upalbum.update_attributes(album_path)
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "albums" SET "title" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["title", "Mua Thu toi fs"], ["updated_at", "2020-08-13 08:30:24.766332"], ["id", 16]]