rails_app/app/controllers/photo_controller.rb

SELECT "photos".* FROM "photos" ORDER BY "photos"."title" ASC
---
  def create
    @photos = Photo.order(:title)