rails_app/app/controllers/users_controller.rb

  def index
    @users = User.order(:firstname)
---
SELECT "users".* FROM "users" WHERE "users"."firstname" = ? LIMIT ?  [["firstname", "Thanh"], ["LIMIT", 1]]