rails_app/app/views/users/index.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
---
<h1>Users#index</h1>
<% @users=User.all%>

SELECT "users".* FROM "users" ORDER BY "users"."firstname" ASC
---

      <td><% User.firstname%></td>